import os  # os модулін импорттау (файлдар мен папкалармен жұмыс істеу үшін)

# Берілген жол (path) - тексерілетін папка немесе файл жолы
path = r"C:\Users\Администратор\Desktop\KBTUpp2\pp2-2025-spring"

def checker(path):
    """ Бұл функция берілген жолдың бар-жоғын тексеріп, егер бар болса,
    оның файл атауын және орналасқан директориясын шығарады. """
    
    # Жолдың бар-жоғын тексереміз
    if os.path.exists(path):  
        print("Name of file: ", os.path.basename(path))  # Файл немесе папка атауын шығарады
        print("Name of directory: ", os.path.dirname(path))  # Файлдың орналасқан жерін көрсетеді
        return "success"  # Функция сәтті аяқталса, "success" қайтарады

# Функцияны шақыру және нәтижесін басып шығару
print(checker(path))  
