import re  # Регулярлы өрнектер кітапханасын жүктейміз

txt = "abbbbbbbb"  # Берілген мәтін

# RegEx өрнегі:
# ^   -> Жолдың басын білдіреді (мәтін "a" әрпінен басталуы керек).
# a   -> Міндетті түрде "a" әрпінен басталуы керек.
# b*  -> "b" әрпі нөл немесе одан көп рет қайталануы мүмкін.
# $   -> Жолдың соңын білдіреді (мәтінде тек "a" және "b" әріптері ғана болуы керек).

x = re.search(r"^ab*$", txt)  # RegEx өрнегі арқылы іздеу

if x:  # Егер сәйкестік табылса
    print("Yes")  # Шартқа сәйкес келеді
else:  # Егер сәйкестік табылмаса
    print("No")  # Шартқа сәйкес келмейді
