def square_generator(n):
    """
    Бұл функция 1-ден n-ге дейінгі сандардың квадраттарын есептеп,
    нәтижені тізім түрінде қайтарады.
    """
    result = []  # Квадраттарды сақтайтын бос тізімді инициализациялаймыз.
    for i in range(n):  # 0-ден n-1-ге дейінгі сандарға цикл жасаймыз.
        
        k = (i+1)**2  # i+1 деген санның квадратын есептейміз.
        result.append(k)  # Есептелген квадратты result тізіміне қосамыз.
    return result  # Барлық квадраттар жинақталған тізімді қайтарып береміз.

# Пайдаланушыдан сан енгізуді сұраймыз.
n = int(input("Enter a number: "))  # Енгізілген жолды бүтін санға айналдырып, n айнымалысына сақтаймыз.

# square_generator функциясын шақырып, қайтарылған тізімді squares айнымалысына сақтаймыз.
squares = square_generator(n)

# Алынған squares тізіміндегі әрбір элементті (квадратты) бір-бірден басып шығарамыз.
for square in squares:
    print(square)
